{
  "Frontend": "Frontend",
  "Backend": "Backend",
  "Design": "UI / UX дизайн",
  "Tools": "Инструменты и прочее",
  "VueJS": {
    "name": "VueJS",
    "description": "Прогрессивный фреймворк для создания пользовательских интерфейсов на JavaScript. У меня больше всего опыта с этим фреймворком."
  },
  "React": {
    "name": "React",
    "description": "Библиотека JavaScript, которая помогает создавать интерактивные пользовательские интерфейсы на веб-сайтах."
  },
  "Typescript": {
    "name": "Typecript",
    "description": "Расширение языка программирования JavaScript, которое позволяет добавлять статическую типизацию к коду."
  },
  "HTML": {
    "name": "HTML5",
    "description": "Стандартный язык разметки для создания структуры веб-страниц."
  },
  "CSS": {
    "name": "CSS3",
    "description": "Язык стилей, используемый для оформления веб-страниц."
  },
  "SCSS": {
    "name": "SCSS",
    "description": "Расширение CSS, которое добавляет дополнительные функции и синтаксические возможности для более удобного и структурированного написания стилей."
  },
  "VueX": {
    "name": "VueX",
    "description": "Библиотека для управления состоянием приложения во фреймворке Vue.js."
  },
  "Vuerouter": {
    "name": "Vue router",
    "description": "Официальная библиотека маршрутизации для фреймворка Vue.js."
  },
  "ARIA": {
    "name": "ARIA",
    "description": "ARIA (Accessible Rich Internet Applications) - это набор атрибутов для HTML и JavaScript, предназначенных для улучшения доступности веб-приложений для пользователей с ограниченными возможностями."
  },
  "Responsive": {
    "name": "Респонсив",
    "description": "Подход, при котором веб-сайт разрабатывается таким образом, чтобы он автоматически адаптировался и выглядел оптимально на разных устройствах и экранах, будь то компьютер, планшет или смартфон."
  },
  "Python": {
    "name": "Python",
    "description": "Популярный и легко читаемый язык программирования."
  },
  "Django": {
    "name": "Django",
    "description": "Высокоуровневый фреймворк для веб-разработки на языке Python."
  },
  "PostgreSQL": {
    "name": "PostgreSQL",
    "description": "Мощная и открытая система управления базами данных (СУБД), часто используемая в веб-разработке."
  },
  "DRF": {
    "name": "Django REST Framework",
    "description": "Это расширение для фреймворка Django, специально разработанное для создания веб-сервисов и API."
  },
  "NextJS": {
    "name": "NextJS",
    "description": "Фреймворк для разработки веб-приложений на основе React. Он предоставляет удобные инструменты для создания быстрых и масштабируемых приложений, включая предварительное рендеринг, маршрутизацию и поддержку серверного рендеринга, что улучшает производительность и опыт пользователей."
  },
  "Figma": {
    "name": "Figma",
    "description": "Онлайн-инструмент для дизайна интерфейсов, который позволяет создавать макеты, прототипы и коллаборировать в реальном времени."
  },
  "Photoshop": {
    "name": "Adobe Photoshop",
    "description": "Программное обеспечение для редактирования и обработки изображений."
  },
  "Framer": {
    "name": "Framer",
    "description": "Онлайн-инструмент для дизайна и прототипирования интерфейсов."
  },
  "NodeJS": {
    "name": "NodeJS",
    "description": "Среда выполнения, которая позволяет запускать JavaScript-код на сервере, а не только в браузере."
  },
  "Git": {
    "name": "Git",
    "description": "Распределенная система управления версиями, которая помогает веб-разработчикам отслеживать изменения в коде, сотрудничать с другими разработчиками и управлять историей проекта."
  },
  "Puppetteer": {
    "name": "Puppetteer",
    "description": "Набор инструментов для автоматизации взаимодействия с веб-страницами. Веб-разработчики могут использовать Puppeteer для создания скриптов, которые могут открывать браузер, навигировать по страницам, выполнять действия, такие как заполнение форм, и извлекать данные, что полезно, например, для тестирования и веб-скрапинга."
  },
  "DiscordAPI": {
    "name": "Discord API",
    "description": "Набор интерфейсов и методов, предоставляемых Discord, платформой для общения. Веб-разработчики могут использовать этот API для создания ботов и интеграций, позволяя автоматизировать действия, управлять сообщениями и взаимодействовать с пользователями на серверах Discord."
  },
  "Vercel": {
    "name": "Vercel",
    "description": "Облачная платформа, которая позволяет разработчикам развертывать и хостить свои веб-приложения и сайты."
  },
  "Jest": {
    "name": "Jest",
    "description": "Популярный фреймворк для тестирования кода на JavaScript."
  },
  "YandexCloud": {
    "name": "Yandex cloud",
    "description": "Облачная платформа, предоставляющая инфраструктуру и сервисы для развертывания, хостинга и масштабирования веб-приложений и сервисов."
  },
  "Midjourney": {
    "name": "Midjourney",
    "description": "Нейросеть, которая генерирует изображения по текстовым описаниям."
  },
  "ChatGPT": {
    "name": "ChatGPT",
    "description": "Модель искусственного интеллекта, способная генерировать текстовые ответы на основе ввода пользователя."
  },
  "This website": "Этот сайт",
  "Discord bot": "Discord бот для нашего сервера с друзьями"
}
